'use client';

import styled from 'styled-components';

const TermsPageLayout = styled.div`
  padding: 30px 20px;
`;

const TermsPageTitle = styled.h2`
  color: #0080ff;
  margin-bottom: 30px;
`;

const TermsPageBoldText = styled.h3`
  margin: 20px 0px;
`;

const TermsPageText = styled.span``;

const TermsPage = () => {
  return (
    <TermsPageLayout>
      <TermsPageTitle>Aimdat 서비스 이용약관</TermsPageTitle>
      <TermsPageBoldText>제1조(목적)</TermsPageBoldText>{' '}
      <TermsPageText>
        본 약관은 Aimdat이 운영하는 Aimdat 사이트(이하 “사이트”이라 한다)에서 제공하는 인터넷 관련
        서비스(이하 “서비스”라 한다)를 이용함에 있어 사이트와 이용자의 권리·의무 및 책임사항을
        규정하는 것을 목적으로 합니다.
      </TermsPageText>
      <TermsPageBoldText>제2조(정의)</TermsPageBoldText>
      <TermsPageText>
        ① “사이트”란 Aimdat이 이용자에게 서비스를 제공하기 위하여 컴퓨터 등의 정보통신설비를
        이용하여 배포한 가상의 공간을 의미합니다. ② “이용자”란 “사이트”에 접속하여 본 약관에 따라
        “사이트”가 제공하는 서비스를 받는 회원 및 비회원을 말합니다. ③ “회원”이라 함은 “사이트”에
        회원등록을 한 자로서, 계속적으로 “사이트”가 제공하는 서비스를 이용할 수 있는 자를 말합니다.
        ④ “비회원”이라 함은 회원등록하지 않고 “사이트”가 제공하는 서비스를 이용하는 자를 말합니다.
      </TermsPageText>
      <TermsPageBoldText>제3조(약관 등의 명시와 설명 및 개정)</TermsPageBoldText>
      <TermsPageText>
        ① “사이트”는 본 약관의 내용을 이용자가 쉽게 알 수 있도록 Aimdat 사이트의 초기 서비스
        화면(전면)에 게시합니다. 다만, 약관의 내용은 이용자가 연결화면을 통하여 볼 수 있도록 할 수
        있습니다. ② “사이트”는 이용자가 약관에 동의하기에 앞서 약관에 정하여져 있는 내용 중
        청약철회·배송책임·환불조건 등과 같은 중요한 내용을 이용자가 이해할 수 있도록 별도의 연결화면
        또는 팝업화면 등을 제공하여 이용자의 확인을 구하여야 합니다. ③ “사이트”는 관련 법령을
        위배하지 않는 범위에서 본 약관을 수시로 개정할 수 있습니다. ④ “사이트”가 본 약관을 개정할
        경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께 사이트의 초기화면에 그 적용일자 7일
        이전부터 적용일자 전일까지 공지합니다. 다만, 이용자에게 불리하게 약관을 변경하는 경우에는
        최소한 30일 이상의 사전 유예기간을 두고 공지합니다. 이 경우 “사이트”는 개정 전 내용과 개정
        후 내용을 명확하게 비교하여 이용자가 알기 쉽도록 표시합니다. ⑤ “사이트”가 본 약관을 개정할
        경우에는 그 개정약관은 그 적용일자 이후에 체결되는 계약에만 적용되고 그 이전에 미리 체결된
        계약에 대해서는 개정 전의 약관조항이 그대로 적용됩니다. 다만, 이미 계약을 체결한 이용자가
        개정약관 조항의 적용을 받기 원하는 뜻을 제3항에 의한 개정약관의 공지기간 내에 관리자
        메일(dhrltjr100@naver.com)에 송신하여 관리자의 동의를 받는 경우에는 개정약관 조항이
        적용됩니다. ⑥ 본 약관에서 정하지 아니한 사항과 본 약관의 해석에 관하여는 전자상거래 등에서의
        소비자보호에 관한 법률, 약관의 규제 등에 관한 법률, 공정거래위원회가 정하는 전자상거래
        등에서의 소비자 보호지침 및 관계법령 또는 상관례에 따릅니다. ⑦ 이용자는 변경된 약관에 대하여
        거부의사를 표현하여 이용약관의 해지를 선택할 수 있습니다.
      </TermsPageText>
      <TermsPageBoldText>제4조(회원가입)</TermsPageBoldText>
      <TermsPageText>
        ① 이용자는 “사이트”가 정한 가입 방법에 따라 양식을 작성하고 회원정보를 기입한 후 본 약관에
        동의한다는 의사표시를 함으로서 회원가입을 신청할 수 있습니다. ② “사이트”는 제1항과 같이
        회원으로 가입할 것을 신청한 이용자 중 다음 각 호에 해당하지 않는 한 회원으로 등록합니다. 1.
        등록 내용에 허위, 기재누락, 오기가 있는 경우 2. 가입신청자가 본 약관 제5조제2항에 의하여
        이전에 회원자격을 상실한 적이 있는 경우. 다만, 제5조제2항에 의한 회원자격 상실 후 3년 이상
        경과한 자로서 “사이트”의 회원재가입 승낙을 얻은 경우에는 예외로 한다.
      </TermsPageText>
      <TermsPageBoldText>제5조(회원 탈퇴 및 자격 상실 등)</TermsPageBoldText>
      <TermsPageText>
        ① 회원은 언제든지 각 소셜 로그인에서 제공하는 연결해제 버튼을 눌러 즉시 회원탈퇴 할 수
        있습니다. ② 회원이 다음 각 호의 사유에 해당하는 경우, “사이트”는 회원자격을 제한 및 정지시킬
        수 있습니다. 1. 가입 신청 시 허위 내용을 등록한 경우 2. “사이트”에 과도한 트래픽을 요청한
        경우 3. “사이트”를 관리자 승낙 없이 크롤링, 스크래핑 한 경우 4. 기타 “사이트”의 서비스
        제공에 지장을 준 경우 ③ “사이트”는 회원 자격을 제한·정지 시킨 후, 동일한 행위가 2회 이상
        반복되거나 30일 내로 해당 사유가 시정되지 아니하는 경우 “사이트”가 해당 회원의 회원자격을
        상실시킬 수 있습니다. ④ “사이트”가 회원자격을 상실시키는 경우에는 회원등록을 말소합니다. 이
        경우 회원에게 이를 통지하고, 회원등록 말소 전에 최소한 30일 이상의 기간을 정하여 소명할
        기회를 부여합니다. ⑤ 회원이 제1항에 따라 연결해제 버튼을 누를 경우, 회원의 모든 데이터는
        즉시 삭제됩니다. 단, 법령에 따라 개인정보를 계속 보존하여야 하는 경우에는, 해당 개인정보를
        별도의 데이터베이스(DB)로 옮기거나 보관장소를 달리하여 보존합니다.
      </TermsPageText>
      <TermsPageBoldText>제6조(회원에 대한 통지)</TermsPageBoldText>
      <TermsPageText>
        “사이트”는 회원에 대한 통지의 경우 1주일 이상 팝업화면 등의 방법으로 개별 통지에 갈음할 수
        있습니다.
      </TermsPageText>
      <TermsPageBoldText>제7조(개인정보 보호)</TermsPageBoldText>
      <TermsPageText>
        ① “사이트”는 이용자의 개인정보 수집 시 서비스 제공을 위하여 필요한 범위 내에서 최소한의
        개인정보를 수집합니다. ② “사이트”는 이용자의 개인정보를 수집·이용하는 때에는 당해 이용자에게
        그 목적을 고지하고 동의를 받습니다. ③ “사이트”는 수집된 개인정보를 목적 외의 용도로 이용할
        수 없으며, 새로운 이용목적이 발생한 경우 또는 제3자에게 제공하는 경우에는 이용·제공단계에서
        당해 이용자에게 그 목적을 고지하고 동의를 받습니다. 다만, 관련 법령에 달리 정함이 있는
        경우에는 예외로 합니다. ④ “사이트” 또는 그로부터 개인정보를 제공받은 제3자는 개인정보의
        수집목적 또는 제공받은 목적을 달성한 때에는 당해 개인정보를 지체 없이 파기합니다. ⑤
        “사이트”는 개인정보의 수집·이용·제공에 관한 동의 란을 미리 선택한 것으로 설정해두지
        않습니다. 또한 개인정보의 수집·이용·제공에 관한 이용자의 동의 거절 시 제한되는 서비스를
        구체적으로 명시하고, 필수수집항목이 아닌 개인정보의 수집·이용·제공에 관한 이용자의 동의
        거절을 이유로 회원가입 등 서비스 제공을 제한하거나 거절하지 않습니다.
      </TermsPageText>
      <TermsPageBoldText>제8조(서비스 이용 방법 및 주의사항)</TermsPageBoldText>
      <TermsPageText>
        ① 이용자는 서비스를 자유롭게 이용할 수 있으나, 아래 각 호의 행위는 하여서는 안 됩니다. 1.
        “사이트”의 서비스 제공에 지장을 주는 행위 2. “사이트”에서 제공하는 데이터를
        관리자(dhrltjr100@naver.com)의 사전 승낙 없이 복제 또는 유통, 상업적 이용,
        데이터베이스(DB)에 저장하는 행위 3. “사이트”의 서비스 제공에 지장을 초래할 만큼 과도한
        트래픽을 유발하는 행위 4. “사이트” 및 기타 제3자의 저작권 등 지적재산권을 침해하는 행위 5.
        기타 현행 법령, 본 약관 및 운영정책 등 “사이트”가 제공하는 서비스 관련 세부지침을 위반하는
        행위 ② “사이트”에서 제공하는 데이터는 신뢰할 수 있는 기관으로부터 얻는 자료를 가공함으로써
        얻은 데이터이나, 데이터의 정확성 및 완전성을 보장하는 것은 아닙니다. ③ 이용자가 관련 법령 및
        “사이트”의 약관 또는 정책을 준수하지 않을 경우, “사이트”는 이용자의 위반행위에 대한 조사를
        실시할 수 있으며, 이용자의 서비스 이용을 제한할 수 있습니다. ④ 이용 제한은 한시적 제한에서
        영구적으로 단계적 제한을 실시함을 원칙으로 하나, 관련 법령에서 금지하는 명백한 불법행위로
        확인될 경우 위반 활동 횟수의 누적 정도와 관계없이 즉시 영구적으로 이용이 제한될 수 있습니다.
        ⑤ 제7조의 경우를 제외한 ID와 비밀번호에 관한 관리책임은 회원에게 있으며, 회원은 자신의 ID 및
        비밀번호를 제3자에게 이용하게 해서는 안 됩니다.
      </TermsPageText>
      <TermsPageBoldText>제9조(손해배상 등)</TermsPageBoldText>
      <TermsPageText>
        ① “사이트”는 관련 법령 상 허용되는 한도 내에서 사이트와 관련하여 본 약관에 명시되지 않은
        어떠한 구체적인 사항에 대한 약정이나 보증을 하지 않습니다. ② “사이트”의 과실로 인하여
        이용자가 손실을 입은 경우 본 약관 및 관련 법령에 따라 손해를 배상합니다. 다만, 법률 상
        허용하는 한도 내에서 간접 손해, 특별 손해, 결과적 손해, 징계적 손해 및 징벌적 손해에 대한
        책임을 부담하지 않습니다. ③ “사이트”에서 무료로 제공하는 서비스와 관련하여 회원에게 어떠한
        손실이 발생하더라도 “사이트”의 고의 또는 과실로 인한 손해발생을 제외하고는 이에 대하여
        책임을 부담하지 않습니다.
        <TermsPageBoldText>제10조(분쟁해결)</TermsPageBoldText> 본 약관은 대한민국법령에 의하여
        규정되고 이행됩니다. “사이트”의 서비스 이용과 관련하여 “사이트”와 이용자 간 분쟁 발생 시
        분쟁 해결을 위해 성실히 협의할 것입니다. 그럼에도 불구하고 해결되지 않을 경우,
        민사소송법상의 관할법원에 소를 제기할 수 있습니다. <br />
        <br />
        <br />- 공지 일자: 2024년 8월 31일 <br />- 적용 일자: 2024년 8월 31일
      </TermsPageText>
    </TermsPageLayout>
  );
};

export default TermsPage;
